/*
各位成等差数列的数称为靓数，求n以内靓数的个数

找规律，10000以内的靓数都在下面的数组里写出来了
99以内的数都是靓数
读数，搜索就行
此题赖皮，说是n<=1000，其实超了 

关键词：简单题 
*/
#include<iostream>
using namespace std;

int main()
{
    int n;
    cin>>n;
    int beautiful[99]={111,123,135,147,159,
                       210,222,234,246,258,
                       321,333,345,357,369,
                       420,432,444,456,468,
                       531,543,555,567,579,
                       630,642,654,666,678,
                       741,753,765,777,789,
                       840,852,864,876,888,
                       951,963,975,987,999,
                       1111,1234,1357,
                       2222,2345,2468,
                       3210,3333,3456,3579,
                       4321,4444,4567,
                       5432,5555,5678,
                       6420,6543,6666,6789,
                       7531,7654,7777,
                       8642,8765,8888,
                       9630,9753,9876,9999};
    
    if(n<100)cout<<n;
    else 
    {
        int i=0;
        while(beautiful[i]<=n)i++;
        cout<<99+i;
    }
    //while(1);
    return 0;
}
